InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/Core/SCB/Peripheral/Register/xHeader/SCB_RegisterPeripheral.h
/**
 *
 * @file SCB_RegisterPeripheral.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 22 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 22 jun. 2020     vyldram    1.0         initial Version@endverbatim
 */
#ifndef XDRIVER_MCU_DRIVER_HEADER_SCB_SCB_PERIPHERAL_SCB_REGISTER_SCB_REGISTERPERIPHERAL_H_
#define XDRIVER_MCU_DRIVER_HEADER_SCB_SCB_PERIPHERAL_SCB_REGISTER_SCB_REGISTERPERIPHERAL_H_

#include <xDriver_MCU/Core/SCB/Peripheral/Struct/xHeader/SCB_StructPeripheral.h>
#include <xDriver_MCU/Core/SCB/Peripheral/Register/xHeader/SCB_RegisterAddress.h>

#define SCB                 (((SCB_TypeDef*)(SCB_BASE)))

/********************************************************************************************/
/************************************* 1 ICTLR ***********************************************/
/********************************************************************************************/
#define SCB_ICTLR            (((ICTLR_TypeDef*)(SCB_BASE+SCB_ICTLR_OFFSET )))
#define SCB_ICTLR_R          (*((volatile const uint32_t *)(SCB_BASE+SCB_ICTLR_OFFSET)))

/********************************************************************************************/
/************************************* 2 ACTLR ***********************************************/
/********************************************************************************************/
#define SCB_ACTLR            (((ACTLR_TypeDef*)(SCB_BASE+SCB_ACTLR_OFFSET )))
#define SCB_ACTLR_R          (*((volatile uint32_t *)(SCB_BASE+SCB_ACTLR_OFFSET)))

/********************************************************************************************/
/************************************* 3 CPUID ***********************************************/
/********************************************************************************************/
#define SCB_CPUID            (((CPUID_TypeDef*)(SCB_BASE+SCB_CPUID_OFFSET )))
#define SCB_CPUID_R          (*((volatile const uint32_t *)(SCB_BASE+SCB_CPUID_OFFSET)))


/********************************************************************************************/
/************************************* 4 INTCTLR ***********************************************/
/********************************************************************************************/
#define SCB_ICSR            (((ICSR_TypeDef*)(SCB_BASE+SCB_ICSR_OFFSET )))
#define SCB_ICSR_R          (*((volatile uint32_t *)(SCB_BASE+SCB_ICSR_OFFSET)))

/********************************************************************************************/
/************************************* 5 VTOR ***********************************************/
/********************************************************************************************/
#define SCB_VTOR            (((VTOR_TypeDef*)(SCB_BASE+SCB_VTOR_OFFSET )))
#define SCB_VTOR_R          (*((volatile uint32_t *)(SCB_BASE+SCB_VTOR_OFFSET)))

/********************************************************************************************/
/************************************* 6 AIRCR ***********************************************/
/********************************************************************************************/
#define SCB_AIRCR            (((AIRCR_TypeDef*)(SCB_BASE+SCB_AIRCR_OFFSET )))
#define SCB_AIRCR_R          (*((volatile uint32_t *)(SCB_BASE+SCB_AIRCR_OFFSET)))

/********************************************************************************************/
/************************************* 7 SCR ***********************************************/
/********************************************************************************************/
#define SCB_SCR            (((SCR_TypeDef*)(SCB_BASE+SCB_SCR_OFFSET )))
#define SCB_SCR_R          (*((volatile uint32_t *)(SCB_BASE+SCB_SCR_OFFSET)))


/********************************************************************************************/
/************************************* 8 CCR ***********************************************/
/********************************************************************************************/
#define SCB_CCR            (((CCR_TypeDef*)(SCB_BASE+SCB_CCR_OFFSET )))
#define SCB_CCR_R          (*((volatile uint32_t *)(SCB_BASE+SCB_CCR_OFFSET)))

/********************************************************************************************/
/************************************* 9 SHPR1 ***********************************************/
/********************************************************************************************/
#define SCB_SHPR1            (((SHPR1_TypeDef*)(SCB_BASE+SCB_SHPR1_OFFSET )))
#define SCB_SHPR1_R          (*((volatile uint32_t *)(SCB_BASE+SCB_SHPR1_OFFSET)))

/********************************************************************************************/
/************************************* 10 SHPR2 ***********************************************/
/********************************************************************************************/
#define SCB_SHPR2            (((SHPR2_TypeDef*)(SCB_BASE+SCB_SHPR2_OFFSET )))
#define SCB_SHPR2_R          (*((volatile uint32_t *)(SCB_BASE+SCB_SHPR2_OFFSET)))

/********************************************************************************************/
/************************************* 11 SHPR3 ***********************************************/
/********************************************************************************************/
#define SCB_SHPR3            (((SHPR3_TypeDef*)(SCB_BASE+SCB_SHPR3_OFFSET )))
#define SCB_SHPR3_R          (*((volatile uint32_t *)(SCB_BASE+SCB_SHPR3_OFFSET)))


/********************************************************************************************/
/************************************* 12 SHCSR ***********************************************/
/********************************************************************************************/
#define SCB_SHCSR            (((SHCSR_TypeDef*)(SCB_BASE+SCB_SHCSR_OFFSET )))
#define SCB_SHCSR_R          (*((volatile uint32_t *)(SCB_BASE+SCB_SHCSR_OFFSET)))

/********************************************************************************************/
/************************************* 13 CFSR ***********************************************/
/********************************************************************************************/
#define SCB_CFSR            (((CFSR_TypeDef*)(SCB_BASE+SCB_CFSR_OFFSET )))
#define SCB_CFSR_R          (*((volatile uint32_t *)(SCB_BASE+SCB_CFSR_OFFSET)))

/********************************************************************************************/
/************************************* 13_1 UCFSR ***********************************************/
/********************************************************************************************/
#define SCB_UCFSR            (((UCFSR_TypeDef*)(SCB_BASE+SCB_UCFSR_OFFSET )))
#define SCB_UCFSR_R          (*((volatile uint16_t *)(SCB_BASE+SCB_UCFSR_OFFSET)))

/********************************************************************************************/
/************************************* 13_2 BCFSR ***********************************************/
/********************************************************************************************/
#define SCB_BCFSR            (((BCFSR_TypeDef*)(SCB_BASE+SCB_BCFSR_OFFSET )))
#define SCB_BCFSR_R          (*((volatile uint8_t *)(SCB_BASE+SCB_BCFSR_OFFSET)))

/********************************************************************************************/
/************************************* 13_3 MCFSR ***********************************************/
/********************************************************************************************/
#define SCB_MCFSR            (((MCFSR_TypeDef*)(SCB_BASE+SCB_MCFSR_OFFSET )))
#define SCB_MCFSR_R          (*((volatile uint8_t *)(SCB_BASE+SCB_MCFSR_OFFSET)))

/********************************************************************************************/
/************************************* 14 HFSR ***********************************************/
/********************************************************************************************/
#define SCB_HFSR            (((HFSR_TypeDef*)(SCB_BASE+SCB_HFSR_OFFSET )))
#define SCB_HFSR_R          (*((volatile uint32_t *)(SCB_BASE+SCB_HFSR_OFFSET)))

/********************************************************************************************/
/************************************* 15 MMFAR ***********************************************/
/********************************************************************************************/
#define SCB_MMFAR            (((MMFAR_TypeDef*)(SCB_BASE+SCB_MMFAR_OFFSET )))
#define SCB_MMFAR_R          (*((volatile uint32_t *)(SCB_BASE+SCB_MMFAR_OFFSET)))

/********************************************************************************************/
/************************************* 16 BFAR ***********************************************/
/********************************************************************************************/
#define SCB_BFAR            (((BFAR_TypeDef*)(SCB_BASE+SCB_BFAR_OFFSET )))
#define SCB_BFAR_R          (*((volatile uint32_t *)(SCB_BASE+SCB_BFAR_OFFSET)))

/********************************************************************************************/
/************************************* 17 AFSR ***********************************************/
/********************************************************************************************/
#define SCB_AFSR            (((AFSR_TypeDef*)(SCB_BASE+SCB_AFSR_OFFSET )))
#define SCB_AFSR_R          (*((volatile uint32_t *)(SCB_BASE+SCB_AFSR_OFFSET)))

/********************************************************************************************/
/************************************* 18 PFR0 ***********************************************/
/********************************************************************************************/
#define SCB_PFR0            (((PFR0_TypeDef*)(SCB_BASE+SCB_PFR0_OFFSET )))
#define SCB_PFR0_R          (*((volatile const uint32_t *)(SCB_BASE+SCB_PFR0_OFFSET)))

/********************************************************************************************/
/************************************* 19 PFR1 ***********************************************/
/********************************************************************************************/
#define SCB_PFR1            (((PFR1_TypeDef*)(SCB_BASE+SCB_PFR1_OFFSET )))
#define SCB_PFR1_R          (*((volatile const uint32_t *)(SCB_BASE+SCB_PFR1_OFFSET)))

/********************************************************************************************/
/************************************* 20 DFR0 ***********************************************/
/********************************************************************************************/
#define SCB_DFR0            (((DFR0_TypeDef*)(SCB_BASE+SCB_DFR0_OFFSET )))
#define SCB_DFR0_R          (*((volatile const uint32_t *)(SCB_BASE+SCB_DFR0_OFFSET)))

/********************************************************************************************/
/************************************* 21 AFR0 ***********************************************/
/********************************************************************************************/
#define SCB_AFR0            (((AFR0_TypeDef*)(SCB_BASE+SCB_AFR0_OFFSET )))
#define SCB_AFR0_R          (*((volatile const uint32_t *)(SCB_BASE+SCB_AFR0_OFFSET)))

/********************************************************************************************/
/************************************* 22 MMFR0 ***********************************************/
/********************************************************************************************/
#define SCB_MMFR0            (((MMFR0_TypeDef*)(SCB_BASE+SCB_MMFR0_OFFSET )))
#define SCB_MMFR0_R          (*((volatile const uint32_t *)(SCB_BASE+SCB_MMFR0_OFFSET)))

/********************************************************************************************/
/************************************* 23 MMFR1 ***********************************************/
/********************************************************************************************/
#define SCB_MMFR1            (((MMFR1_TypeDef*)(SCB_BASE+SCB_MMFR1_OFFSET )))
#define SCB_MMFR1_R          (*((volatile const uint32_t *)(SCB_BASE+SCB_MMFR1_OFFSET)))

/********************************************************************************************/
/************************************* 24 MMFR2 ***********************************************/
/********************************************************************************************/
#define SCB_MMFR2            (((MMFR2_TypeDef*)(SCB_BASE+SCB_MMFR2_OFFSET )))
#define SCB_MMFR2_R          (*((volatile const uint32_t *)(SCB_BASE+SCB_MMFR2_OFFSET)))

/********************************************************************************************/
/************************************* 25 MMFR3 ***********************************************/
/********************************************************************************************/
#define SCB_MMFR3            (((MMFR3_TypeDef*)(SCB_BASE+SCB_MMFR3_OFFSET )))
#define SCB_MMFR3_R          (*((volatile const uint32_t *)(SCB_BASE+SCB_MMFR3_OFFSET)))

/********************************************************************************************/
/************************************* 26 ISAR0 ***********************************************/
/********************************************************************************************/
#define SCB_ISAR0            (((ISAR0_TypeDef*)(SCB_BASE+SCB_ISAR0_OFFSET )))
#define SCB_ISAR0_R          (*((volatile const uint32_t *)(SCB_BASE+SCB_ISAR0_OFFSET)))

/********************************************************************************************/
/************************************* 27 ISAR1 ***********************************************/
/********************************************************************************************/
#define SCB_ISAR1            (((ISAR1_TypeDef*)(SCB_BASE+SCB_ISAR1_OFFSET )))
#define SCB_ISAR1_R          (*((volatile const uint32_t *)(SCB_BASE+SCB_ISAR1_OFFSET)))

/********************************************************************************************/
/************************************* 28 ISAR2 ***********************************************/
/********************************************************************************************/
#define SCB_ISAR2            (((ISAR2_TypeDef*)(SCB_BASE+SCB_ISAR2_OFFSET )))
#define SCB_ISAR2_R          (*((volatile const uint32_t *)(SCB_BASE+SCB_ISAR2_OFFSET)))

/********************************************************************************************/
/************************************* 29 ISAR3 ***********************************************/
/********************************************************************************************/
#define SCB_ISAR3            (((ISAR3_TypeDef*)(SCB_BASE+SCB_ISAR3_OFFSET )))
#define SCB_ISAR3_R          (*((volatile const uint32_t *)(SCB_BASE+SCB_ISAR3_OFFSET)))

/********************************************************************************************/
/************************************* 30 ISAR4 ***********************************************/
/********************************************************************************************/
#define SCB_ISAR4            (((ISAR4_TypeDef*)(SCB_BASE+SCB_ISAR4_OFFSET )))
#define SCB_ISAR4_R          (*((volatile const uint32_t *)(SCB_BASE+SCB_ISAR4_OFFSET)))







#endif /* XDRIVER_MCU_DRIVER_HEADER_SCB_SCB_PERIPHERAL_SCB_REGISTER_SCB_REGISTERPERIPHERAL_H_ */
